In [ ]:
import pandas as pd
import config

In [ ]:
filename = "ogun_lab2_1.sql"
cursor = config.cursor

def sql_update(query):
    # Execute Statment
    query = (query.upper())
    cursor.execute(query)
    # Create and save to query to SQL file
    #f = open("{}".format(filename), "a+")
    #f.write(query + ';')
    #f.close()
    
def reset_table():
    drop_table = ['drop table Concerts',
                  'drop table Arenas',
                  'drop table Performers',
                  'DROP TABLE PerformanceTypes']
    for query in drop_table:
        sql_update(query.upper())
        
reset_table()

# Section A

#### 1. Write and execute the SQL statements to create the 4 tables given above. Choose appropriate data types for each column, and   declare primary key and foreign key constraints as appropriate.

In [ ]:
queries = ["create table PerformanceTypes(PerformanceTypeName varchar2(20),Primary Key(PerformanceTypeName))",
           "create table Performers(PerformerID int primary key, FirstName varchar2(10), LastName varchar2(15) , Address varchar2(30), PerformanceTypeName varchar2(10), foreign key(PerformanceTypeName) references PerformanceTypes (PerformanceTypeName))",
           "create table Arenas(ArenaID int primary key, ArenaName varchar2(10), City varchar2(10), Capacity int)",
           "create table Concerts(PerformerID int, ArenaID int , ConcertDate date, foreign key(PerformerID) references Performers(PerformerID), foreign key(ArenaID) references Arenas(ArenaID))"
            ]
for query in queries:
    sql_update(query)

#### 2. Insert rows in the PerformanceTypes table, for type ‘singer’, ‘dancer’ and ‘comedian’.

In [ ]:
queries = ["insert into PerformanceTypes values('Singer')",
           "insert into PerformanceTypes values('Dancer')",
           "insert into PerformanceTypes values('Comedian')"]
for query in queries:
    sql_update(query)

#### 3. Write the SQL statement to modify your Performers table to add a new column called DateOfBirth. Choose the appropriate data type for this column. The values in the column could be null

In [ ]:
query = "ALTER TABLE Performers add DateOfbirth date"
sql_update(query)

#### 4. Insert one row in the Performers table with PerformerID 1, name John Dow, address Annapolis, MD, and performance type ‘singer’

In [ ]:
query = "insert into Performers values ({}, 'John', 'Dow','Annapolis MD','Singer',NULL)".format(1)
sql_update(query)

#### 5. Try now to insert a performer row with a PerformanceTypeName that does not exist in PerformanceTypes table (ex. ‘painter’).      What happens? Show your work with errors.

In [ ]:
query = "insert into Performers values ({}, 'Jones', 'Wod','Annapolis, MD','Painter',NULL)".format(2)
sql_update(query)
# Error occuer bacuause Painter is not delcared as part of the performance types

#### 6. Insert 3 more rows in the Performers table, with  names ‘Matt Smith’, ‘Jane Brown’, and respectively ‘Jennifer Shade’, and addresses ‘Baltimore, MD’, ‘New York, NY’, and respectively ‘Seattle, WA’. All these 3 performers should be of type ‘dancer’!

In [ ]:
queries = ["insert into Performers values (2, 'Matt', 'Smith','Baltimore, MD','Dancer',NULL)",
           "insert into Performers values (3, 'Jane', 'Brown','New York, NY','Dancer',NULL)",
           "insert into Performers values (4, 'Jennifer', 'Shade','Seattle, WA','Dancer',NULL)"
          ]
for query in queries:
    sql_update(query)

#### 7. Change the DateOfBirth of the performer with id 1 to be ‘1990-03-02’

In [ ]:
query = "UPDATE Performers SET DateOfbirth = TO_DATE('1990-03-02','yyyy-mm-dd') WHERE PerformerID = 1"
sql_update(query)
# Initially gave errors but had to append the date string so SQL could format the date format

#### 8. Remove the performer ‘Matt Smith’ from the Performers table

In [ ]:
query = "DELETE FROM Performers WHERE FirstName='Matt' And LastName='Smith'"
sql_update(query)

#### 9.	Write the SQL statement to remove performance type ‘singer’ from the PerformanceTypes table

In [ ]:
query = "delete from PERFORMANCETYPES where PERFORMANCETYPENAME = 'SINGER'"
sql_update(query)

#### 10.	Execute the statement above, then list all rows from the PerformanceTypes table. Was ‘singer’ removed? Explain why the row was removed from the PerformanceTypes table, or why it was not removed. 

> The item singer was removed deleted because it doesn't have any constraints with the other tables

#### 11.	Write the SQL statement to update the performance type name for ‘dancer’ in PerformanceTypes to be ‘dance performer’

In [ ]:
query = "update PERFORMANCETYPES set PERFORMANCETYPENAME = 'DANCE PERFORMER' where PERFORMANCETYPENAME = 'DANCER'"
sql_update(query)

#### 12.	Execute the statement above. Does the query succeed? 
> The query was successfully executed and dance performer was updated

#### 13.	Write the SQL statements to insert 3 rows with ids 1, 2, and respectively 3 into the Arenas table

In [ ]:
queries = ["insert into Arenas values (1,'Zoo','Lincoln',12345)",
           "insert into Arenas values (2,'CDM','Chicago',67890)",
           "insert into Arenas values (3,'UIC','Rosemont',12309)"]
for query in queries:
    sql_update(query)

#### 14.	Write the SQL statements to insert 4 rows in the Concerts table, two of them for arena 1, and two for arena 2

In [ ]:
queries = ["insert into Concerts values(1,1, TO_DATE('11-13-2017','mm-dd-YY'))",
           "insert into Concerts values(2,1, TO_DATE('11-01-2001','mm-dd-YY'))",
           "insert into Concerts values(1,2, TO_DATE('11-13-2018','mm-dd-YY'))",
           "insert into Concerts values(3,2, TO_DATE('10-01-2018','mm-dd-YY'))"] #TO_DATE('1990-03-02','yyyy-mm-dd')
for query in queries:
    sql_update(query)

#### 15.	Create a new ‘Dancers’ table with the same structure as the Performers table

In [ ]:
query = ["create table Dancers (PerformerID int primary key, \
          FirstName varchar2(10), LastName varchar2(15) , Address varchar2(30),\
          PerformanceTypeName varchar2(10) DateOfBirth date, foreign key(PerformanceTypeName) \
          references PerformanceTypes (PerformanceTypeName)) "]
sql_update(query)

#### 16.	 Insert all performers of type ‘dancer’ from the Performers table into the Dancers table

In [ ]:
queries = ["insert into Dancers values (2, 'Matt', 'Smith','Baltimore, MD','Dancer',NULL)",
           "insert into Dancers values (3, 'Jane', 'Brown','New York, NY','Dancer',NULL)",
           "insert into Dancers values (4, 'Jennifer', 'Shade','Seattle, WA','Dancer',NULL)"
          ]

# Section B

#### 2.	Consider the below relational schema 
Customer (name, email, phone, totalPurchase) Video (vID, name, year, cost, genre) Actor (aID, name, dob) Price (priceCode, cost) Rents (email-FK, vID-FK, priceCode-FK, rentalFee, lateFee, date, dueDate, returnDate) Performs (vID-FK, aID-FK) Here is the schema for these tables, with primary key underlined

In [ ]:
filename = "ogun_lab2_2.sql"

queries = ["create table Customer (name varchar2(15),email varchar2(25) primary key,phone int,totalPurchase int)",
           "create table Video (vID int primary key,name varchar2(20),year date,cost int,genre varchar2(10))",
           "create table Actor (aID int primary key,name varchar2(15),dob date)",
           "create table Price (priceCode int primary key,cost int)",
           "create table Rents (email varchar2(25),vID int,priceCode int,rentalFee int,lateFee int, rentdate date,dueDate date, foreign key(email) references Customer(email), foreign key(vID) references Video(vID),foreign key(priceCode) references Price(priceCode))",
           "create table Performs (vID int,aID int, foreign key(vID) references Video(vID),foreign key(aID) references Actor(aID))",
           ""]
for query in queries:
    sql_update(query)